{
  "posts": [
    {
      "id": 12,
      "title": "DevFest 2025 & Sheridan Datathon ",
      "slug": "devfest-2025-sheridan-datathon-recap",   
      "description": "Recap of an incredible weekend at DevFest 2025 and Sheridan Datathon, where our team built 'Avacado', an AI-driven housing recommendation system that won the Best Use of GCP award, among the top 4 projects!",
      "content": "8 hours of DevFest and 15 hours of Hacking!! The most thrilling weekend thus far. Past weekend, I had the opportunity to participate in DevFest 2025 organized by Google Developer Student Clubs Sheridan and the Sheridan Datathon 2025. It was an exhilarating experience filled with learning, collaboration, and innovation.\n\nAt DevFest, I attended insightful sessions on the latest technologies and trends in the developer community. The event provided a platform to connect with so many developers, share ideas, and gain inspiration from industry experts.\n\nFollowing DevFest, we participated in the Sheridan Datathon 2025, where we went on a coding spree for 15 hours to build a solution addressing real-world challenges. Our project, 'Avacado', helps you find out the true cost of living in a city, we pull data from news articles, weather information in the region and these metrics are fed to our ML weighted model, trained on RandomRegressor Classifier, which generates a AvoScore. Avoscore helps us in predicting the overall cost of living and the breakdown of all the features are also accessible using SHAP’s explainability. If you’re a student on a co-op term and thinking of switching places, Avocado is here! (We watch the prices of Avocado seriously!) We leveraged technologies such as Python, RandomForest, RandomRegressor, GCP Cloud Run, Google Maps API, and Gemini to create a robust and user-friendly application.\n\nThe highlight of the weekend was when our team was honoured with the Best Use of GCP award, placing us among the top 4 projects.\n\nParticipating in DevFest 2025 and the Sheridan Datathon was an incredible experience that not only enhanced my technical skills but also fostered teamwork and problem-solving abilities. I'm grateful for the opportunity to collaborate with talented individuals and contribute to innovative solutions that can make a positive impact.\n\nA big thank you to the organizers, mentors, and fellow participants for pulling this off!. Looking forward to more such exciting opportunities in the future!",      "photographer": "Multiple Contributors",
      "timePosted": "November 2025",
      "category": "Hackathon Win & Next Steps",
      "readTime": "5 min read",
      "tags": ["GenAI", "DevOps", "Open Source"],
      "publishedDate": "2025-11-05",
      "author": "Aman Purohit",
      "featured": true,
      "featuredImages": ["/hack/datathon25/devfest.jpeg","/hack/datathon25/avocado-demo2.GIF", "/hack/datathon25/avocadodemo.mp4", "/hack/datathon25/team.jpeg", "/hack/datathon25/solo.jpeg", "/hack/datathon25/dev.jpeg"],
      "links": [
        {
          "name": "Project Repository",
          "url": "https://github.com/purohitamann/Avocado"},
          {
            "name": "Avocado (LIVE DEMO)",
            "url": "https://avocado.amanpurohit.com"
          }]

    },
    {
      "id": 11,
      "title": "We Got the place surrounded!",
      "slug": "we-got-the-place-surrounded",
      "description": "2nd Place at Canada DevOps CoP Hackathon for GenAI!",
      "content": "What if I told you we built a CLI tool that can deploy multiple GenAI Agents on Kubernetes clusters - in less than 24 hours? Would you believe me? Honestly, I’m still questioning that decision myself. The Null-Pointers, my dream team - Siddharth Lamba, George Farag, Martin Pham, Hassan Elbaytam, and I - were definitely living in productive delusion when we pitched this idea.\n\nBut we did it.\n\nPresenting Paragon AI - built on a GenAI-as-a-Service architecture. Think of it as Terraform for GenAI agents. In just three terminal commands, you can spin up default or custom agents with the configuration of your choice, auto-generate Docker images, and deploy them to Kubernetes clusters - scalable and reproducible from your CLI.\n\nWe saved 50+ hours of manual programming and cut down 80% of ClickOps usually needed to deploy GenAI agents. I’ve shared a small clip that showcases our hack (because yes, you need to see it to believe it). And the cherry on top? We secured 2nd place - Runner-up at the Canada DevOps Community of Practice Hackathon for GenAI!\n\nWith constant collaboration between our team and mentors, we’re excited to announce that Paragon AI will be open-sourced soon. You’ll be able to deploy GenAI agents across any cloud provider, just like spinning up resources with Terraform. Your terminal. Your Cloud Provider.\n\nHuge thank you to Adam Shaldam for connecting us with the GTA edition of the Hackathon. To our mentor and biggest cheerleader, Professor AlaaAldin (Aladdin) AlRadhi , and Kanwarpreet Singh - thank you for fueling our chaos with guidance.\n\nThe community at the hackathon was buzzing with innovation and kindness. The best part? Sheridan dominated the leaderboard - 3 teams in the Top 4: \nRunner-up (that’s us!)\nMost Impactful\nMost Innovative\n\nDon’t stop until it’s done. Building in a community is a cheat code. Find your tribe, stay delusional enough to dream big, and bold enough to build it. Who knows - you might just start an open-source movement one day.\n\nThanks for sticking around to read this blurb :)",
      "photographer": "Multiple Contributors",
      "timePosted": "November 2025",
      "category": "Hackathon Win & Next Steps",
      "readTime": "10 min read",
      "tags": ["GenAI", "DevOps", "Open Source"],
      "publishedDate": "2025-11-05",
      "author": "Aman Purohit",
      "featured": true,
      "featuredImages": ["/hack/devops/01.jpeg","/hack/devops/demo.mp4", "/hack/devops/02.jpeg", "/hack/devops/03.jpeg", "/hack/devops/04.jpeg", "/hack/devops/01.jpeg"]
    },
    {
      "id": 10,
      "title": "My Time Under the Sun",
      "slug": "my-time-under-the-sun-at-skynet",
      "description": "Thank you, SunLife!",
      "content": "Hi, this may be the last time that I will get to address myself as the GenAI Intern at Sun Life in the Inner Source Department. I might sound like a broken record at this point, but this has been one of the most thrilling experiences of my career. Working at an organization that is testament to “Change is the only constant” has been inspiring. I was blown away when I first started by how a 160-year-old institution is leveraging Generative AI in its workflow. Having had the opportunity to work on something that every Sun Lifer loves is one of the highlights I cannot forget. A big thanks to Pavithra Viswanathan, Viorel Bosanszky, Mahdi Khandaker, Alex Near and the entire Skynet team for making my summer experience at Sun Life unforgettable. I’m grateful for every single interaction I’ve had, every single coffee chat, the connections, and all the amazing folks I met from different parts of the country.\n\nI cannot forget how folks at Sun Life Recruitment and Student Engagement were committed to creating a wholesome student experience. With a number of initiatives and events like the CI Challenge, I was given the opportunity to get out of my comfort zone and present in front of executives with my amazing team, Alyssa Shimabukuro, Alexandra Cole, Laith Amad, and Ahmed Bein. To provide more context, we presented a more contextual use of Microsoft platforms in our existing GenAI tool, Sun Life Asks. I also had the opportunity to meet multiple executives from across the organization at Beat the Boss events. Big thanks to Amy Weston & Nassima Younes for always being there to guide me throughout my time here at Sun Life.\n\nI’m glad that I was part of an organization and a team that gave me a chance to bring my perspective to the table. I got to work with a stack like Terraform and AWS Bedrock in action outside of school, which was as thrilling as it sounds. Another takeaway from my time at Sun Life is that learning should always be the end goal. Anyone or anything (AI) can code and work their way around a stack or technology. Curiosity, willingness to learn, the human nuance, and the ability to accept feedback are necessary to excel in any SWE role.\n\nLastly, I want to end this by referencing Sun Life's CEO, Kevin Strain, from one of the coffee chat conversations, as he noted that we have to balance our caution around AI with the need to be fast, innovative and competitive, and I couldn't agree more! To harness the true power of AI we need to let it do its thing, enabling speed and acceleration in ways that still support data privacy and good governance. And that was my time at Sun Life.\n\nIt’s true! Life is brighter under the sun!",
      "photographer": "Reon Pyne",
      "timePosted": "August 2025",
      "category": "Summer Internship Experience",
      "readTime": "8 min read",
      "tags": ["AI", "internship", "Skynet"],
      "publishedDate": "2025-01-15",
      "author": "Aman Purohit",
      "featured": true,
      "featuredImages": ["/ci.jpg", "/c2.jpg", "/cig.jpg", "/three.jpg", "/kumon.png", "/hack.jpeg", "/volunteer.MOV"]
    }
  ]}