{
  "posts": [
    {
    
      "id": 10,
      "title": "My Time Under the Sun at Skynet",
      "slug": "my-time-under-the-sun-at-skynet",
      "description": "Thank you, SunLife!",
"content": "Hi, this may be the last time that I will get to address myself as the GenAI Intern at Sun Life in the Inner Source Department. I might sound like a broken record at this point, but this has been one of the most thrilling experiences of my career. Working at an organization that is testament to “Change is the only constant” has been inspiring. I was blown away when I first started by how a 160-year-old institution is leveraging Generative AI in its workflow. Having had the opportunity to work on something that every Sun Lifer loves is one of the highlights I cannot forget. A big thanks to Pavithra Viswanathan, Viorel Bosanszky, Mahdi Khandaker, Alex Near and the entire Skynet team for making my summer experience at Sun Life unforgettable. I’m grateful for every single interaction I’ve had, every single coffee chat, the connections, and all the amazing folks I met from different parts of the country.\n\nI cannot forget how folks at Sun Life Recruitment and Student Engagement were committed to creating a wholesome student experience. With a number of initiatives and events like the CI Challenge, I was given the opportunity to get out of my comfort zone and present in front of executives with my amazing team, Alyssa Shimabukuro, Alexandra Cole, Laith Amad, and Ahmed Bein. To provide more context, we presented a more contextual use of Microsoft platforms in our existing GenAI tool, Sun Life Asks. I also had the opportunity to meet multiple executives from across the organization at Beat the Boss events. Big thanks to Amy Weston & Nassima Younes for always being there to guide me throughout my time here at Sun Life.\n\nI’m glad that I was part of an organization and a team that gave me a chance to bring my perspective to the table. I got to work with a stack like Terraform and AWS Bedrock in action outside of school, which was as thrilling as it sounds. Another takeaway from my time at Sun Life is that learning should always be the end goal. Anyone or anything (AI) can code and work their way around a stack or technology. Curiosity, willingness to learn, the human nuance, and the ability to accept feedback are necessary to excel in any SWE role.\n\nLastly, I want to end this by quoting Kevin Strain from one of the coffee chat conversations: “the only problem with AI is that we’re too cautious”  and I couldn't agree more! To harness the true power of AI we need to let it do its thing, without interfering with so many guardrails in use cases that are reversible at least. And that was my time at Sun Life.\n\nIt’s true! Life is brighter under the sun! ",
      "timePosted": "August 2025",
      "category": "Summer Internship Experience",
      "readTime": "7 min read",
      "tags": ["AI", "internship", "Skynet"],
      "publishedDate": "2025-01-15",
      "author": "Aman Purohit",
      "featured": true,
      "featuredImages": ["/ci.jpg", "/c2.jpg","/kumon.png","/hack.jpeg","/volunteer.MOV"]
    },
    {
      "id": 1,
      "title": "My First Open-Source Contribution to the Internet Archive",
      "slug": "open-source-contribution-internet-archive",
      "description": "Even though it was a small 'good first issue,' it felt incredibly exciting. Documenting my journey and the lessons learned from contributing to such an important project.",
      "content": "Making my first open-source contribution was both nerve-wracking and exciting. I chose the Internet Archive because of their mission to preserve digital content for future generations.\n\nThe contribution itself was small - just fixing a documentation issue - but the process taught me so much about:\n\n- Reading and understanding large codebases\n- Following contribution guidelines\n- Working with maintainers and the community\n- The importance of clear documentation\n\nWhat started as a simple 'good first issue' became a gateway into the open-source world. The Internet Archive maintainers were incredibly welcoming and provided helpful feedback throughout the process.\n\nThis experience has motivated me to contribute more to open-source projects and give back to the community that has given me so much.",
      "timePosted": "January 2025",
      "category": "Open Source",
      "readTime": "5 min read",
      "tags": ["open-source", "internet-archive", "contribution", "documentation"],
      "publishedDate": "2025-01-15",
      "author": "Aman Purohit",
      "featured": true
    },
    {
      "id": 2,
      "title": "Students guide to becoming 'AI first' at School",
      "slug": "ai-first-student-guide",
      "description": "There's more to using ChatGPT than just helping you paraphrase. A comprehensive guide for students to effectively leverage AI tools in their academic journey.",
      "content": "The rise of AI tools has fundamentally changed how we approach learning and problem-solving. As a student, embracing an 'AI-first' mindset doesn't mean replacing your thinking - it means augmenting it.\n\nHere's how to effectively integrate AI into your academic workflow:\n\n## Beyond Simple Questions\n\nMost students use AI for basic queries, but the real power lies in:\n- Research assistance and source discovery\n- Code debugging and explanation\n- Writing structure and improvement\n- Complex problem breakdown\n\n## Ethical Considerations\n\nUsing AI responsibly means:\n- Understanding your institution's AI policies\n- Citing AI assistance when appropriate\n- Using AI as a learning tool, not a replacement for learning\n- Maintaining academic integrity\n\n## Practical Applications\n\n1. **Research**: Use AI to find relevant papers and summarize key concepts\n2. **Writing**: Get feedback on structure and clarity\n3. **Programming**: Debug code and understand complex algorithms\n4. **Study**: Create practice questions and explanations\n\nThe goal is to become more efficient and effective in your learning while maintaining the integrity of your education.",
      "timePosted": "December 2024",
      "category": "AI & Education",
      "readTime": "8 min read",
      "tags": ["ai", "education", "students", "productivity", "ethics"],
      "publishedDate": "2024-12-10",
      "author": "Aman Purohit",
      "featured": true
    },
    {
      "id": 3,
      "title": "Building Real-time Applications with WebSockets",
      "slug": "building-realtime-websockets",
      "description": "A deep dive into creating responsive real-time applications using WebSockets, covering both frontend and backend implementation.",
      "content": "Real-time applications are becoming increasingly important in today's web development landscape. From chat applications to live updates, WebSockets provide the foundation for truly interactive experiences.\n\n## What are WebSockets?\n\nWebSockets provide a persistent, full-duplex communication channel between the client and server. Unlike traditional HTTP requests, WebSockets maintain an open connection, allowing for instant bi-directional communication.\n\n## Implementation Overview\n\n### Server-side Setup\n\nUsing Node.js with Socket.io:\n\n```javascript\nconst io = require('socket.io')(server);\n\nio.on('connection', (socket) => {\n  console.log('User connected');\n  \n  socket.on('message', (data) => {\n    io.emit('message', data);\n  });\n});\n```\n\n### Client-side Integration\n\n```javascript\nconst socket = io();\n\nsocket.on('message', (data) => {\n  updateUI(data);\n});\n\nsocket.emit('message', messageData);\n```\n\n## Best Practices\n\n1. **Error Handling**: Always implement reconnection logic\n2. **Performance**: Use rooms and namespaces for scalability\n3. **Security**: Validate all incoming data\n4. **Fallbacks**: Implement polling fallbacks for older browsers\n\nReal-time features can dramatically improve user experience when implemented correctly.",
      "timePosted": "November 2024",
      "category": "Web Development",
      "readTime": "12 min read",
      "tags": ["websockets", "realtime", "nodejs", "javascript", "web-development"],
      "publishedDate": "2024-11-20",
      "author": "Aman Purohit",
      "featured": false
    }
  ]
}