{
  "posts": [
    {
    
      "id": 10,
      "title": "My Time Under the Sun",
      "slug": "my-time-under-the-sun-at-skynet",
      "description": "Thank you, SunLife!",
"content": "Hi, this may be the last time that I will get to address myself as the GenAI Intern at Sun Life in the Inner Source Department. I might sound like a broken record at this point, but this has been one of the most thrilling experiences of my career. Working at an organization that is testament to “Change is the only constant” has been inspiring. I was blown away when I first started by how a 160-year-old institution is leveraging Generative AI in its workflow. Having had the opportunity to work on something that every Sun Lifer loves is one of the highlights I cannot forget. A big thanks to Pavithra Viswanathan, Viorel Bosanszky, Mahdi Khandaker, Alex Near and the entire Skynet team for making my summer experience at Sun Life unforgettable. I’m grateful for every single interaction I’ve had, every single coffee chat, the connections, and all the amazing folks I met from different parts of the country.\n\nI cannot forget how folks at Sun Life Recruitment and Student Engagement were committed to creating a wholesome student experience. With a number of initiatives and events like the CI Challenge, I was given the opportunity to get out of my comfort zone and present in front of executives with my amazing team, Alyssa Shimabukuro, Alexandra Cole, Laith Amad, and Ahmed Bein. To provide more context, we presented a more contextual use of Microsoft platforms in our existing GenAI tool, Sun Life Asks. I also had the opportunity to meet multiple executives from across the organization at Beat the Boss events. Big thanks to Amy Weston & Nassima Younes for always being there to guide me throughout my time here at Sun Life.\n\nI’m glad that I was part of an organization and a team that gave me a chance to bring my perspective to the table. I got to work with a stack like Terraform and AWS Bedrock in action outside of school, which was as thrilling as it sounds. Another takeaway from my time at Sun Life is that learning should always be the end goal. Anyone or anything (AI) can code and work their way around a stack or technology. Curiosity, willingness to learn, the human nuance, and the ability to accept feedback are necessary to excel in any SWE role.\n\nLastly, I want to end this by referencing Sun Life's CEO, Kevin Strain, from one of the coffee chat conversations, as he noted that we have to balance our caution around AI with the need to be fast, innovative and competitive, and I couldn't agree more! To harness the true power of AI we need to let it do its thing, enabling speed and acceleration in ways that still support data privacy and good governance. And that was my time at Sun Life. \n\nIt’s true! Life is brighter under the sun! ",
      "timePosted": "August 2025",
      "category": "Summer Internship Experience",
      "readTime": "7 min read",
      "tags": ["AI", "internship", "Skynet"],
      "publishedDate": "2025-01-15",
      "author": "Aman Purohit",
      "featured": true,
      "featuredImages": ["/ci.jpg", "/c2.jpg","cig.jpg","three.jpg","/kumon.png","/hack.jpeg","/volunteer.MOV"]
    }
  ]
}
